nc: 10   # number of classes

# --------- 尺度超参（与原版保持一致）---------
scales:
  l: [1.00, 1.00, 1024]

# =========================================================
# Backbone
# =========================================================
backbone:
  # [from, number, module, args]
  # P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]      # 0  下采样到 P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]      # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]      # 2

  # P2/4：用 FFD_AA 做第一次抗混叠下采样（stride=2）
  - [-1, 1, FFD_AA, [64, 64]]                                    # 3  P2/4

  # ★ Blocks 深度做轻微调整，保证 P5 也有足够语义容量
  - [-1, 1, Blocks, [64,  BasicBlock, 2, 2, 'relu']]             # 4  P2/4  stage2
  - [-1, 1, Blocks, [128, BasicBlock, 3, 3, 'relu']]             # 5  P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 4, 4, 'relu']]             # 6  P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 3, 5, 'relu']]             # 7  P5/32   ★ 由 2 -> 3

# =========================================================
# Head (三件套：FAMix_Lite + FFD_AA + GAU)
# =========================================================
head:
  # ---------- P5 分支 ----------
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                # 8  P5 -> 256
  - [-1, 1, FAMix_Lite, [256, 0.25, [1, 2], 1e-4]]               # 9  频域+零参注意力融合（等参增强）
  - [-1, 1, Conv, [256, 1, 1]]                                   # 10 Y5 lateral

  # ---------- P5 -> P4 融合 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]                  # 11 上采样到 P4 尺度
  - [6,   1, Conv, [256, 1, 1, None, 1, 1, False]]               # 12 P4 -> 256
  - [[-2, -1], 1, Concat, [1]]                                   # 13 concat(P5↑, P4)
  - [-1, 1, C3Ghost, [256, 0.5]]                                 # 14 P4 融合块（输出 256）

  # ---------- P4 -> P3 融合 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]                  # 15 上采样到 P3 尺度
  - [4,   1, Focus, [128, 1]]                                    # 16 P3 轻微增强（输出 128）
  - [[-1, -2, 5], 1, Concat, [1]]                                # 17 concat(P3增强(128), P4↑(256), P3原(128)) -> 512
  - [-1, 1, FAMix_Lite, [512, 0.25, [1, 2], 1e-4]]               # 18 频域+零参注意力融合（输入 512）
  - [-1, 1, C3Ghost, [256, 0.5]]                                 # 19 P3 融合块（输出 256）

  # ---------- 自顶向下再回传（P3->P4） ----------
  - [-1, 1, FFD_AA, [256, 256]]                                  # 20 抗混叠频引导下采样到 P4 尺度（256）
  - [[-1, 14], 1, Concat, [1]]                                   # 21 concat(当前 P4, 早先 P4 融合)
  - [-1, 1, C3Ghost, [256, 0.5]]                                 # 22 P4 最终（输出 256）

  # ---------- 再次下采样到 P5 ----------
  - [-1, 1, FFD_AA, [256, 256]]                                  # 23 下采样到 P5 尺度（256）
  - [[-1, 10], 1, Concat, [1]]                                   # 24 concat(当前 P5, Y5 lateral)
  - [-1, 1, C3Ghost, [256, 0.5]]                                 # 25 P5 最终（输出 256）

  # ---------- 语义对齐：P3 <- P5（合并 DySample+SACi 为 GAU） ----------
  - [[19, 25], 1, GAU, [256, 256, 256]]                          # 26 对齐到 P3/8（输出 256）

  # ---------- 解码（使用 P3, P4, P5 三尺度） ----------
  - [[26, 22, 25], 1, RTDETRDecoder, [nc, 256, 400, 6, 8, 3]]    # 27 RTDETR 解码器（偏精度配置）
