# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-R18 (Small-Object Enhanced, P2–P5)
# 本文件在原始 rtdetr-r18.yaml 的基础上做了最小侵入改动：
# 1) 0/1/2 三层 ConvNormLayer → LFAS（轻量频域感知 stem），索引保持不变
# 2) 新增 FAAF 与 P2Head，在不破坏原有 X3/F4/F5 索引的前提下，补充 P2 与精炼 P3'
# 3) RTDETRDecoder 从 3 层输入扩展为 4 层（num_levels: 3 → 4）

# -------------------- Parameters --------------------
nc: 10  # VisDrone2019-DET
scales:
  l: [1.00, 0.90, 1024]  # 宽度系数降到0.90，帮助总参≈18M

# -------------------- Backbone --------------------
backbone:
  # [from, repeats, module, args]
  # 原文件 0~3：三个 ConvNormLayer + MaxPool 到 P2/4【0: L11-L18】
  - [-1, 1, LFAS, [32, 2]]                            # 0: (原 0) P1/2   ConvNormLayer→LFAS(3->32, s=2)
  - [-1, 1, LFAS, [32, 1]]                            # 1: (原 1)
  - [-1, 1, LFAS, [64, 1]]                            # 2: (原 2)
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]                  # 3: (原 3) P2/4

  # 原文件 4~7：ResNet18 Blocks，输出 P3/8、P4/16、P5/32【0: L16-L20】
  # 这里保持不变，确保与后续 head 索引兼容
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']]   # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']]  # 5  P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]  # 6  P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']]  # 7  P5/32

# -------------------- Head (FPN/PAN as original) --------------------
head:
  # ==== 顶层 AIFI 分支（保持与原文件一致）【0: L22-L31】====
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]     # 8: input_proj.2   (from 7)
  - [-1, 1, AIFI, [1024, 8]]                          # 9
  - [-1, 1, Conv, [256, 1, 1]]                        # 10: Y5 lateral_convs.0

  # ==== 上采到 P4 并融合【0: L27-L31】====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 11
  - [6, 1, Conv, [256, 1, 1, None, 1, 1, False]]      # 12: input_proj.1  (from 6=P4)
  - [[-2, -1], 1, Concat, [1]]                        # 13
  - [-1, 3, RepC3, [256, 0.5]]                        # 14: fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]                        # 15: Y4 lateral_convs.1

  # ==== 上采到 P3 并融合【0: L33-L36】【2: L12-L15】====
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]        # 16
  - [5, 1, Conv, [256, 1, 1, None, 1, 1, False]]      # 17  (from 5=P3)
  - [[-2, -1], 1, Concat, [1]]                        # 18: cat backbone P3
  - [-1, 3, RepC3, [256, 0.5]]                        # 19: X3 (P3输出)

  # ==== PAN 回落到 P4【2: L17-L20】====
  - [-1, 1, Conv, [256, 3, 2]]                        # 20: downsample_convs.0
  - [[-1, 15], 1, Concat, [1]]                        # 21: cat Y4
  - [-1, 3, RepC3, [256, 0.5]]                        # 22: F4

  # ==== PAN 回落到 P5【2: L21-L23】====
  - [-1, 1, Conv, [256, 3, 2]]                        # 23: downsample_convs.1
  - [[-1, 10], 1, Concat, [1]]                        # 24: cat Y5
  - [-1, 3, RepC3, [256, 0.5]]                        # 25: F5

  # ===== 新增：频域自适应多尺度融合（FAAF）→ 精炼 P3'  =====
  # 直接使用 Backbone 的 P3/8(=5), P4/16(=6), P5/32(=7)，输出到 P3 尺度，通道=256 以便与原管线一致
  - [[5, 6, 7], 1, FAAF, [128, 256, 512, 256]]        # 26: P3' (refined)

  # ===== 新增：高分辨率 P2 分支（P2Head） =====
  # 以 P3'(=26) 上采样与浅层 P2/4(=4) 融合，得到 P2 (stride=4)
  - [[26, 4], 1, P2Head, [256, 64, 128]]              # 27: P2 (small-object head feature)

  # ===== 检测头：RT-DETR 解码器，输入从 3 层 → 4 层 =====
  # 原文件：[[19, 22, 25], 1, RTDETRDecoder, [..., 3]]  # Detect(P3, P4, P5)【2: L25-L26】
  # 现在：  [[27, 26, 22, 25], 1, RTDETRDecoder, [..., 4]]  # Detect(P2, P3', P4, P5)
  - [[27, 26, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 4]]
