# ================== Model 1: Add LAHF Backbone ==================
nc: 10
scales:
  l: [1.0, 1.0, 1024]

backbone:
  # Stem (含 BlurPool)
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, BlurPool2d,    [2, 3]]                         # [Ours]

  # Stage 2 (LAHF)
  - [-1, 1, Blocks, [64,  LAHF, 2, 2, 'relu']]             # [Ours]

  - [-1, 1, Blocks, [128, LAHFV2, 2, 3, 'relu']]           # [Ours]

  # Stage 4 (LAHF)
  - [-1, 1, Blocks, [256, LAHF, 2, 4, 'relu']]             # [Ours]

  # Stage 5 (LAHF)
  - [-1, 1, Blocks, [512, LAHF, 2, 5, 'relu']]             # [Ours]

# [Head]: 保持 Baseline 状态 (为了控制变量)
head:
  # P5 (Standard AIFI)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [6,   1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [5,   1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]                           # 19 (X3)

  # P3 -> P4 (Standard Conv)
  - [-1, 1, Conv, [256, 3, 2]]                           # 20 [Baseline] 还没换 AFDS
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]                           # 22 (F4)

  # P4 -> P5 (Standard Conv)
  - [-1, 1, Conv, [256, 3, 2]]                           # 23 [Baseline] 还没换 AFDS
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]                           # 25 (F5)

  # [Decoder] (No SAGM)
  - [[19, 22, 25], 1, RTDETRDecoder, [nc, 256, 400, 4, 8, 3]]