# ================== VisDrone RT-DETR-R18 + HFLiteBackbone ==================

# --------- 数据与类别 ---------
nc: 10   # number of classes (VisDrone2019-DET)

scales:
  l: [1.0, 1.0, 1024]   # depth_mult, width_mult, img_size

# ================== Backbone：HFLite ResNet18 ==================
backbone:
  # [from, number, module, args]

  # Stem
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]   # 0  P1/2
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]   # 1
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]   # 2
  - [-1, 1, BlurPool2d,    [2, 3]]                         # 3  P2/4

  # Stage 2: 64 通道，保持 1/4 下采样
  - [-1, 1, Blocks, [64,  LAHF, 2, 2, 'relu']]         # 4

  # Stage 3: 128 通道，1/8 下采样（首块 stride=2）
  - [-1, 1, Blocks, [128, LAHFV2, 2, 3, 'relu']]         # 5  P3/8

  # Stage 4: 256 通道，1/16 下采样
  - [-1, 1, Blocks, [256, LAHF, 2, 4, 'relu']]         # 6  P4/16

  # Stage 5: 512 通道，1/32 下采样
  - [-1, 1, Blocks, [512, LAHF, 2, 5, 'relu']]         # 7  P5/32

# ================== Head：沿用你当前的 FAMix_Lite + FFD_AA + GAU ==================
head:
  # ---------- 顶端 P5 ----------
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]                # 8  P5 -> 256
  - [-1, 1, SAFM, [256, 0.25, [1, 3], 1e-4]]               # 9  (AIFI -> FAMix_Lite)
  - [-1, 1, Conv, [256, 1, 1]]                                   # 10 Y5 lateral

  # ---------- P5 -> P4 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]                  # 11 上采样到 P4
  - [6,   1, Conv, [256, 1, 1, None, 1, 1, False]]               # 12 P4 -> 256
  - [[-2, -1], 1, Concat, [1]]                                   # 13 concat(P5↑, P4)
  - [-1, 3, RepC3, [256, 0.5]]                                   # 14 P4 融合
  - [-1, 1, Conv, [256, 1, 1]]                                   # 15 Y4 lateral

  # ---------- P4 -> P3 ----------
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]                  # 16 上采样到 P3
  - [5,   1, Conv, [256, 1, 1, None, 1, 1, False]]               # 17 P3 -> 256
  - [[-2, -1], 1, Concat, [1]]                                   # 18 concat(P4↑(256), P3(256)) -> 512
  - [-1, 1, SAFM, [512, 0.25, [1, 3], 1e-4]]               # 19 在 P3 融合后加入 FAMix_Lite
  - [-1, 3, RepC3, [256, 0.5]]                                   # 20 P3 融合输出 (X3)

  # ---------- 自底向上（用 FFD_AA 下采样，保持 RepC3） ----------
  - [-1, 1, Conv, [256, 3, 2]]                                  # 21 下采样到 P4 尺度
  - [[-1, 15], 1, Concat, [1]]                                   # 22 concat(当前 P4, Y4)
  - [-1, 3, RepC3, [256, 0.5]]                                   # 23 P4 输出 (F4)

  - [-1, 1, Conv, [256, 3, 2]]                                  # 24 下采样到 P5 尺度
  - [[-1, 10], 1, Concat, [1]]                                   # 25 concat(当前 P5, Y5)
  - [-1, 3, RepC3, [256, 0.5]]                                   # 26 P5 输出 (F5)

  # ---------- 语义对齐（GAU：P3 <- P5），解码 ----------
  - [[20, 26], 1, SAGM, [256, 256, 256]]                          # 27 对齐到 P3/8（输出 256）
  - [[27, 23, 26], 1, RTDETRDecoder, [nc, 256, 400, 4, 8, 3]]    # 28 解码器 (P3_aligned, P4, P5)
