# ================== Model 2: Add SAFM Neck ==================
nc: 10
scales:
  l: [1.0, 1.0, 1024]

# [Backbone]: Ours (LAHF)
backbone:
  # Stem
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  # Stages
  - [-1, 1, Blocks, [64, BasicBlock, 2, 2, 'relu']] # 4
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']] # 6-P4/16
  - [-1, 1, Blocks, [512, BasicBlock, 2, 5, 'relu']] # 7-P5/32

# [Head]: 引入 SAFM (Ours)，但保持标准采样
head:
  # P5 (Replace AIFI with SAFM)
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, SAFM, [256, 0.25, [1, 3], 1e-4]]             # [Ours] 替换了 AIFI
  - [-1, 1, Conv, [256, 1, 1]]

  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [6,   1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]
  - [-1, 1, Conv, [256, 1, 1]]

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']]
  - [5,   1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 1, SAFM, [512, 0.25, [1, 3], 1e-4]]             # [Ours] P3 增加 SAFM
  - [-1, 3, RepC3, [256, 0.5]]                           # 20 (X3)

  - [-1, 1, Conv, [256, 3, 2]]                           # 21 [Baseline] 还没换 AFDS
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]                           # 23 (F4)

  # P4 -> P5 (Standard Conv)
  - [-1, 1, Conv, [256, 3, 2]]                           # 24 [Baseline] 还没换 AFDS
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, RepC3, [256, 0.5]]                           # 26 (F5)

  # [Decoder] (No SAGM)
  - [[20, 23, 26], 1, RTDETRDecoder, [nc, 256, 400, 4, 8, 3]]